# Enable Homebrew Cask support (required for GUI applications)
tap "homebrew/cask"

# =========================
# Programming Languages
# =========================

# Python 3.12 – primary Python runtime for automation, networking, tooling
brew "python@3.12"

# Go – required for cloud-native tools, networking utilities, and CLIs
brew "go"

# UV - Extremely fast Python package installer and resolver, written in Rust
brew "uv"

# Pipx : Execute binaries from Python packages in isolated environments
brew "pipx"


# =========================
# Core Dev / Infra Tools
# =========================

# entr – run arbitrary commands when files change (great for dev loops)
brew "entr"

# Docker CLI – container runtime client
brew "docker"

# Docker Desktop – full Docker engine + UI for macOS
cask "docker-desktop"

# kubectl – Kubernetes command-line client
brew "kubectl"

# Minikube – local single-node Kubernetes clusters
brew "minikube"

# Helm – Kubernetes package manager (charts)
brew "helm"

# kind – Kubernetes-in-Docker (multi-node clusters for testing)
brew "kind"

# Git – distributed version control system
brew "git"

# lazygit – terminal UI for Git
brew "lazygit"

# lazydocker – terminal UI for Docker
brew "lazydocker"

# Jenkins – automation server / CI engine
brew "jenkins"

# Terraform – infrastructure as code (IaC)
brew "terraform"

# tfproviderlint – Terraform provider development linter
brew "tfproviderlint"

# Ansible – configuration management and automation
brew "ansible"


# =========================
# Cloud CLIs
# =========================

# aws-console – enhanced AWS CLI wrapper
brew "aws-console"

# aws-shell – interactive shell for AWS CLI
brew "aws-shell"

# aws-vault – secure credential management for AWS
brew "aws-vault"

# awscli – official AWS command-line interface
brew "awscli"

# azure-cli – Microsoft Azure command-line interface
brew "azure-cli"


# =========================
# General CLI Utilities
# =========================

# geoip – lookup geographic info from IP addresses
#brew "geoip"

# gh – GitHub official CLI
brew "gh"

# jq – JSON processor (essential for APIs and automation)
brew "jq"

# asciinema – record terminal sessions
brew "asciinema"

# PowerShell – cross-platform automation shell
brew "powershell"

# sha3sum – SHA-3 checksum utility
brew "sha3sum"

# b2sum – BLAKE2 checksum utility
brew "b2sum"

# bat – enhanced cat with syntax highlighting
brew "bat"

# tmux – terminal multiplexer
brew "tmux"

# screen – classic terminal multiplexer
brew "screen"


# =========================
# Core Unix / System Tools
# =========================

# curl – HTTP client for APIs and downloads
brew "curl"

# wget – non-interactive network downloader
brew "wget"

# gnupg – encryption and signing tools (GPG)
brew "gnupg"

# OpenSSL 3 – cryptographic libraries
brew "openssl@3"

# rsync – fast incremental file transfer
brew "rsync"

# rclone – sync files to/from cloud storage providers
brew "rclone"

# ripgrep – fast recursive text search
brew "ripgrep"

# fd – faster, user-friendly alternative to find
brew "fd"

# fzf – fuzzy finder for files and commands
brew "fzf"

# eza – modern replacement for ls
brew "eza"

# htop – interactive process viewer
brew "htop"

# btop – modern resource monitor (CPU/mem/disk)
brew "btop"

# yq – YAML processor (jq for YAML)
brew "yq"

# tldr – simplified man pages
brew "tldr"


# =========================
# Web / Docs
# =========================

# httpie – human-friendly HTTP client
brew "httpie"

# Hugo – static site generator
brew "hugo"


# =========================
# Networking / Diagnostics
# =========================

# fping – fast ICMP ping for multiple hosts
brew "fping"

# hping – packet crafting and TCP/IP testing
#brew "hping"

# gping – ping with a graphical terminal UI
brew "gping"

# iperf3 – network bandwidth testing
brew "iperf3"

# ipcalc – IP subnet calculator
brew "ipcalc"



# ipinfo – IP address information lookup
brew "ipinfo"

# iproute2mac – Linux-style ip tools for macOS
brew "iproute2mac"

# ipv6calc – IPv6 address calculations
brew "ipv6calc"

# subnetcalc – advanced subnet calculations
brew "subnetcalc"

# telnet – legacy TCP connectivity testing
brew "telnet"

# mtr – traceroute + ping combined
brew "mtr"

# tcping – TCP-based ping utility
brew "tcping"

# nmap – network discovery and port scanning
brew "nmap"

# tcpdump – packet capture tool
brew "tcpdump"

# socat – advanced socket relay and tunneling
brew "socat"

# netcat – simple TCP/UDP networking utility
brew "netcat"

# Tailscale - VPN !
brew "tailscale"

# =========================
# Writing / Editing
# =========================

# pandoc – document format converter
brew "pandoc"

# vim – classic terminal text editor
brew "vim"

# neovim – modern Vim-based editor
brew "neovim"


# =========================
# Media / Video
# =========================

# ffmpeg – audio/video processing toolkit
brew "ffmpeg"

# yt-dlp – advanced YouTube/media downloader
brew "yt-dlp"


# =========================
# Terminals & IDEs
# =========================

# iTerm2 – advanced terminal emulator
cask "iterm2"

# Visual Studio Code – popular extensible code editor
cask "visual-studio-code"

# Sublime Text – fast lightweight text editor
cask "sublime-text"

# Cursor – AI-powered code editor
cask "cursor"

# Ghostty – modern GPU-accelerated terminal
cask "ghostty"

# Hyper – modern GPU-accelerated terminal
cask "hyper"

# GitHub Desktop – GUI client for GitHub
cask "github"

# Google Antigravity
cask "antigravity"

# =========================
# Communication
# =========================

# Discord – chat and voice communication
cask "discord"

# Webex – Cisco collaboration platform
cask "webex"

# WhatsApp – messaging client
cask "whatsapp"

# Slkck – messaging client
cask "slack"


# =========================
# Browsers
# =========================

# Firefox – open-source web browser
cask "firefox"

# Google Chrome – Chromium-based browser
cask "google-chrome"

# Brave – privacy-focused Chromium browser
cask "brave-browser"

# Opera – feature-rich web browser
cask "opera"


# =========================
# File Management
# =========================

# tree – display directory trees
brew "tree"

# AppCleaner – remove apps and leftover files
cask "appcleaner"

# DaisyDisk – disk space visualization tool
cask "daisydisk"

# Dropbox – cloud file synchronization
cask "dropbox"

# Google Drive – Google cloud storage client
cask "google-drive"

# Transmit – advanced SFTP/FTP client
cask "transmit"

# Boring Notch
cask "TheBoredTeam/boring-notch/boring-notch"

# Bartender
cask "bartender"

# =========================
# Networking GUIs
# =========================

# Wireshark – packet capture and analysis GUI
cask "wireshark"

# Royal TSX – remote connection manager (SSH/RDP/etc.)
cask "royal-tsx"

# Draw.io – diagramming tool
cask "drawio"


# =========================
# Notes / PDFs
# =========================

# Notion – notes, docs, and databases
cask "notion"

# Skim – lightweight PDF reader with annotations
cask "skim"


# =========================
# Audio / Video Apps
# =========================

# Audacity – audio editor
cask "audacity"

# VLC – media player
cask "vlc"

# IINA – modern macOS media player
cask "iina"

# HandBrake – video transcoder
cask "handbrake"

# Permute – media conversion GUI
cask "permute"


# =========================
# Productivity
# =========================

# Path Finder – advanced Finder replacement
cask "path-finder"

# Bloom – focus and productivity timer
cask "bloom"

# Fantastical – calendar application
cask "fantastical"

# Alfred – launcher and productivity workflow tool
cask "alfred"

# Blip - Send files
cask "blip"

# Latest – app update notifier
cask "latest"

#Moom – window snapping and management
cask "moom"

# Hidden Bar – menu bar icon manager
cask "hiddenbar"

# Stats – system monitor in menu bar
cask "stats"

# Unarchiver - Open Source Unarchiver
cask "the-unarchiver"

# =========================
# Miscellaneous
# =========================

# Minecraft – game client
cask "minecraft"

# Paintbrush – lightweight image editor
cask "paintbrush"

# ImageOptim
cask "imageoptim"

# iMazing – iOS device management
cask "imazing"

# 1Password – password manager
cask "1password"

# Lasso – window and workflow automation
cask "lasso"

# Copilot Money – personal finance tracking
cask "copilot-money"


# =========================
# AI Tools
# =========================

# LM Studio – local LLM runner
cask "lm-studio"

# ChatGPT – official OpenAI desktop client
cask "chatgpt"