tap "hudochenkov/sshpass"
tap "koekeishiya/formulae"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Record and share terminal sessions
brew "asciinema"
# Command-line to use AWS CLI credentials to launch the AWS console in a browser
brew "aws-console"
# Integrated shell for working with the AWS CLI
brew "aws-shell"
# Securely store and access AWS credentials in development environments
brew "aws-vault"
# Official Amazon AWS command-line interface
brew "awscli"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Command-line implementation of the BLAKE3 cryptographic hash function
brew "b3sum"
# Light-weight XML database and XPath/XQuery processor
brew "basex"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Run arbitrary commands when files change
brew "entr"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Scriptable ping program for checking if multiple hosts are up
brew "fping"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Ping, but with a graph
brew "gping"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Kubernetes package manager
brew "helm"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Configurable static site generator
brew "hugo"
# Calculate various network masks, etc. from a given IP address
brew "ipcalc"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Tool for calculation of IP networks
brew "ipinfo"
# CLI wrapper for basic network utilities on macOS - ip command
brew "iproute2mac"
# Small utility for manipulating IPv6 addresses
brew "ipv6calc"
# Extendable open source continuous integration server
brew "jenkins"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Run local Kubernetes cluster in Docker
brew "kind"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Access large language models from the command-line
brew "llm"
# Run a Kubernetes cluster locally
brew "minikube"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Terminal multiplexer with VT100/ANSI terminal emulation
brew "screen"
# Keccak, SHA-3, SHAKE, and RawSHAKE checksum utilities
brew "sha3sum"
# IPv4/IPv6 subnet calculator
brew "subnetcalc"
# TCP connect to the given IP/port combo
brew "tcping"
# User interface to the TELNET protocol
brew "telnet"
# Tool to build, change, and version infrastructure
brew "terraform"
# Terraform Provider Lint Tool
brew "tfproviderlint"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Subversion-like utility to work with Jackrabbit FileVault
brew "vault-cli"
# Vi 'workalike' with many additional features
brew "vim"
# HashiCorp Vault interactive shell
brew "vsh"
# Internet file retriever
brew "wget"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
brew "hudochenkov/sshpass/sshpass"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Application launcher and productivity software
cask "alfred"
# Distribution of the Python and R programming languages for scientific computing
cask "anaconda"
# Memory training application
cask "anki"
# Application uninstaller
cask "appcleaner"
# Web browser focusing on privacy
cask "brave-browser"
# Open source IDE for exploring and testing APIs
cask "bruno"
# Screen recorder and video editor
cask "camtasia"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Tool to show live information about the batteries in various devices
cask "coconutbattery"
# Track and budget money
cask "copilot-money"
# Write, edit, and chat about your code with AI
cask "cursor"
# Disk space visualiser
cask "daisydisk"
# AI-powered translator
cask "deepl"
# Utilities designed to make common development tasks easier
cask "devtoys"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Downloads videos from different websites
cask "downie"
# Online diagram software
cask "drawio"
# Calendar software
cask "fantastical"
# Web browser
cask "firefox"
# Clipboard manager for developers
cask "flycut"
cask "font-jetbrains-mono"
# Finder replacement and FTP, SFTP, WebDAV and Amazon s3 client
cask "forklift"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Desktop client for GitHub repositories
cask "github"
# Git client focusing on productivity
cask "gitkraken"
# Web browser
cask "google-chrome"
# Open-source video transcoder
cask "handbrake-app"
# Terminal built on web technologies
cask "hyper"
# Free and open-source media player
cask "iina"
# iPhone management application
cask "imazing"
# Vector graphics editor
cask "inkscape"
# System monitoring app
cask "istat-menus"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# End-to-end encryption software
cask "keybase"
# Utility that shows the latest app updates
cask "latest"
# Discover, download, and run local LLMs
cask "lm-studio"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Email client
cask "microsoft-outlook"
# Presentation software
cask "microsoft-powerpoint"
# Word processor
cask "microsoft-word"
# Sandbox construction video game
cask "minecraft"
# Online collaborative whiteboard platform
cask "miro"
# Orchestrates virtual Ubuntu instances
cask "multipass"
# App to write, plan, collaborate, and get organised
cask "notion"
# Calendar for professionals and teams
cask "notion-calendar"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Cloud storage client
cask "onedrive"
# Web browser
cask "opera"
# Image editor
cask "paintbrush"
# Reference management software for researchers
cask "papers"
# Converts and edits video, audio or image files
cask "permute"
# Collaboration platform for API development
cask "postman"
# Command-line shell and scripting language
cask "powershell"
# Bridges Proton Mail to email clients supporting IMAP and SMTP protocols
cask "proton-mail-bridge"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Remote management solution
cask "royal-tsx"
# Collection of apps available by subscription
cask "setapp"
# PDF reader and note-taking application
cask "skim"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# System monitor for the menu bar
cask "stats"
# Text editor for code, markup and prose
cask "sublime-text"
# Mesh VPN based on WireGuard
cask "tailscale-app"
# File transfer application
cask "transmit"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Video communication and virtual meeting platform
cask "webex"
# Video communication and virtual meeting platform
cask "webex-meetings"
# Network protocol analyzer
cask "wireshark-app"
# Video communication and virtual meeting platform
cask "zoom"
# Collect, organise, cite, and share research sources
cask "zotero"
vscode "4ops.terraform"
vscode "andytruett.textfsm-syntax"
vscode "bceskavich.theme-dracula-at-night"
vscode "chrmarti.regex"
vscode "davidanson.vscode-markdownlint"
vscode "docker.docker"
vscode "dotjoshjohnson.xml"
vscode "ecmel.vscode-html-css"
vscode "eliverlara.andromeda"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "gerane.theme-flatlandmonokai"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "hashicorp.terraform"
vscode "hediet.vscode-drawio"
vscode "humao.rest-client"
vscode "marko2276.yang"
vscode "mechatroner.rainbow-csv"
vscode "mintlify.document"
vscode "mohsen1.prettify-json"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.live-server"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "naumovs.color-highlight"
vscode "oderwat.indent-rainbow"
vscode "peakchen90.open-html-in-browser"
vscode "philxor.iosxr"
vscode "quicktype.quicktype"
vscode "reblws.one-dark-flatland-monokai"
vscode "redhat.vscode-yaml"
vscode "ryu1kn.partial-diff"
vscode "samuelcolvin.jinjahtml"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "srl-labs.vscode-containerlab"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscode-icons-team.vscode-icons"
vscode "wholroyd.jinja"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
vscode "zainchen.json"
